start = """
Привет! Это прототип LinguaMate. 

Что такое Linguamate?
LinguaMate — это решение на основе искусственного интеллекта для людей, которые хотят погрузиться в языковую среду, которую они выбрали, даже находясь вдали от неё. 

Это друг в вашей телефонной книге, который всегда рад поболтать о вашем или ЕГО дне.

Здесь вы можете пообщатся с Максом, вашим другом по переписке из Британии еще со школьных деньков!

/help - для помощи
"""

help = """
/start - Выввод стартового сообщения
/help - Выввод команд и их действий
/restart - Обнуление памяти Макса о Вас
/feedback - Оставить обратную связь для нашей команды
"""

restart = """
СДЕЛАЙ ПОДТВЕРЖДЕНИЕ СБРОСА ДАННЫХ, НАСТРОЕК
"""

feedback = """
РЕАЛИЗУЙ ФОРМУ СБОРА ОБРАТНОЙ СВЯЗИ
"""